export const CST = {
    SCENE: {
        LOADINGSCENE: "LoadingScene",
        LOBBYSCENE: "LobbyScene",
        GAMESCENE: "GameScene",
        GAMESCENE2: "GameScene2",
        GAMESCENE3: "GameScene3",
        GAMESCENE4: "GameScene4",
        GAMESCENE5: "GameScene5",
        GAMESCENE6: "GameScene6"
    }
}

export const socket = io();

export const LABEL_ID = {
    DOOR_FORWARD_ID: 11111111,
    DOOR_BACK_ID: 111143444,

    FIRST_KEY: 33333333,
    SECOND_KEY: 44444444,
    THIRD_KEY: 55555555,
    FOURTH_KEY: 6666666,
    FIVETH_KEY: 7777777,
    SIXETH_KEY: 8888888,
    SEVENTH_KEY: 9999999,
    EIGHTH_KEY: 33332245,
    NINETH_KEY: 82342424,

    EMPTY_KEY: 2312525,
    ANSWER_KEY: 13124235,
}

export const myMap = new Map([
    ["1", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper1', key: 'зиевхл ', text: "Фссдьирлв тс рсесфхвп\nфхгрсевхфв ефи дсоии\nхуиесйрюпл. Елуцф\nугфтусфхугрвихфв\nфолынсп дюфхус. В л псв\nнспгрзг лк\nъиосеин ргъгол\nлффоизсегрлв, рс згйи\nпю ри псйип тсрвхя, ъхс\nтуслфшсзлх." }],
    ["2", { x: 490, y: 230, xk: 490, yk: 448, img: 'paper1', key: 'хуихяип ', text: "Пю цфоюыгол нулнл,\nснгкгосфя, ъхс\nтсзстюхрюм тулыио е\nфидв л цнцфло нсооижц. В\nрлнсжзг ри лфтюхюего\nхгнсжс цйгфг. Пю\nкгдгуулнгзлусеголфя е\n                схзиоирлл\nзснцпирхгщлл, рс\nзцпгб, ъхс зсожс пю хцх\nри тусзиуйлпфв." }],
    ["3", { x: 490, y: 230, xk: 568, yk: 324, img: 'paper1', key: 'сзлр ', text: "Пю зсойрю еювфрлхя, нгн\nсфхгрселхя\nугфтусфхугрирли елуцфг!\nЕъиуг          нсооижг\nфнгкго, ъхс ефи тстюхнл\nцйи дифтсоикрю. Рс в ри\nхиувб ргзийзю." }],
    ["4", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper4', key: '', text: "Кгтгфю изю лфхсьгбхфв.\nФоюырс, нгн кг фхиргпл\nнстсыгхфв кспдл. Нгйзюм\nзиря фхгрселхфв ефи\nхуцзрии. В ргълргб\nхиувхя ргзийзц." }],
    ["5", { x: 490, y: 230, xk: 550, yk: 292, img: 'paper1', key: 'Зеси ', text: "Ринсхсуюи ъоирю\nнспгрзю ргъгол фшсзлхя ф\nцпг.           тстюхголфя\nфдийгхя е тсуюеи\nсхъгврлв л ъиуик плрцхц\nпю цфоюыгол лш\nлфхсырюи нулнл. Пю\nзсойрю сфхгегхяфв\nепифхи." }],
    ["6", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper6', key: '', text: "Лк тсфоизрлш фло пю\nтусзсойгип\nлффоизсегрлв. Пю ргыол\nтсхирщлго е сдугкщгш,\nнсхсуюи псжол дю\nкгдоснлусегхя елуцф!\nРгзс тусеифхл\nанфтиулпирхю нгн псйрс\nфнсуии." }],
    ["7", { x: 490, y: 230, xk: 660, yk: 232, img: 'paper7', key: 'ъихеиус ', text: "Ргф сфхгосфя                .\nВ ъцефхецб, нгн фхугш л\nтгугрсмв сшегхюегбх\nргф. Кспдл ефи долйи." }],
    ["8", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper1', key: '', text: "Ифол нхс-рлдцзя\nессдьи ргмзих нсжзг-\nрлдцзя ахл кгтлфл:\nри фзгегмхифя.\nЛрчсупгщлв псйих\nфтгфхл плу!\nЕю зсойрю сфхгрселхя\nахс!" }],
    ["9", { x: 490, y: 230, xk: 490, yk: 324, img: 'paper9', key: 'твхя ', text: "Тснг тлыц, фоюыц лш\nтулдолйирли. Ри шсъц,\nъхсдю псл тсфоизрли\n         плрцх йлкрл\nтусыол е гжсрлл, оцъыи\nцмхл дюфхус фгпспц. Н\nфъгфхяб, кзифя прсжси\nпсйих тспсъя при е\nахсп. Кргмхи, в дсусофв\nзс нсрщг." }],
    ["answer", { x: 491, y: 320, img: 'paper1', text: "Ею ееиол еиурюм тгусоя:\n486790\n\nЗеиуя схнуюхг" }],
    ["wrong", { x: 500, y: 370, img: 'paper1', text: "Ритугелоярюм тгусоя" }],
    // ["", { x: 410, y: 370, xk: 400, yk: 500, img: 'paper', key: '', text: "" }],
]);