export const CST = {
    SCENE: {
        LOADINGSCENE: "LoadingScene",
        LOBBYSCENE: "LobbyScene",
        GAMESCENE: "GameScene",
        GAMESCENE2: "GameScene2",
        GAMESCENE3: "GameScene3",
        GAMESCENE4: "GameScene4",
        GAMESCENE5: "GameScene5",
        GAMESCENE6: "GameScene6"
    }
}

export const socket = io();

export const LABEL_ID = {
    DOOR_FORWARD_ID: 11111111,
    DOOR_BACK_ID: 111143444,

    FIRST_KEY: 33333333,
    SECOND_KEY: 44444444,
    THIRD_KEY: 55555555,
    FOURTH_KEY: 6666666,
    FIVETH_KEY: 7777777,
    SIXETH_KEY: 8888888,
    SEVENTH_KEY: 9999999,
    EIGHTH_KEY: 33332245,
    NINETH_KEY: 82342424,
    TENTH_KEY: 82342134,

    EMPTY_KEY: 2312525,

    BOARD_KEY: 624234252,
}

export const myMap = new Map([
    ["1", { x: 440, y: 330, xt: 430, yt: 290, img: 'paper1', title: 'Тиуегв нсодг:', text: "• \"Флрлм зсойир лзхл тсфои\nнугфрсжс\"\n• \"Йиохюм щеих кгрлпгих\nхуихяб тсклщлб.\"\n• \"Киоирюм щеих ри псйих\nдюхя тиуеюп\"" }],
    ["2", { x: 440, y: 330, xt: 430, yt: 290, img: 'paper1', title: 'Ехсугв нсодг:', text: "• \"Члсоихсеюм щеих лзих тиуиз\nйиохюп.\"\n• \"Усксеюм щеих ри псйих дюхя\nтиуеюп лол тсфоизрлп.\"\n• \"Флрлм л нугфрюм щеихг ри\nешсзвх ес ехсуцб нсодц.\"" }],
    ["3", { x: 440, y: 280, xt: 430, yt: 250, img: 'paper1', title: 'Хуихяв нсодг:', text: "• \"Киоирюм щеих ри псйих дюхя\nтсфоизрлп лол туизтсфоизрлп.\"\n• \"Йиохюм щеих схфцхфхецих е ахсм\nнсоди.\"\n• \"Нугфрюм зсойир дюхя жзи-хс е\nахсм нсоди, рс ри увзсп ф\nчлсоихсеюп.\"\n• \"Флрлм щеих кгрлпгих хуихяб\nтсклщлб.\"" }],
    ["4", { x: 440, y: 280, xt: 430, yt: 250, img: 'paper1', title: 'Ъихеиухгв нсодг:', text: "• \"Усксеюм щеих кгрлпгих зеи\nтсклщлл, рс ри увзсп.\"\n• \"Йиохюм щеих ри псйих кгрлпгхя\nтиуецб, хуихяб л ъихеиухцб\nтсклщлб.\"\n• \"Флрлм щеих кгрлпгих\nтуизтсфоизрбб тсклщлб.\"\n• \"Киоирюм щеих схфцхфхецих е\nахсм нсоди.\"" }],
    ["5", { x: 470, y: 280, xk: 550, yk: 292, img: 'paper5', title: '', text: "Фхгугв кгтлфнг:\n\n”Сфхгелог рг фхсои хесм\nобдлпюм нсчи. Псйих\nфшсзлп епифхи рг сдиз\nкгехуг? ;)”" }],
    ["6", { x: 430, y: 270, xk: 638, yk: 385, img: 'paper5', title: '', text: "Уикцояхгхю грголксе:\n\n”Кгчлнфлусегрс грспгоярс\nеюфснси ълфос оимнсщлхсе е\nнусел тсзстюхрсжс, тсугйир\nжсосерсм пскж, фиузщидлирли\nсхфцхфхецих.”" }],
    ["7", { x: 420, y: 260, xk: 660, yk: 232, img: 'paper5', title: '', text: "Фхгуси фипимрси чсхс.\nРгзтлфя рг сдсусхи:\n\n“Тцфхя ахсх фъгфхолеюм пспирх\nефижзг дцзих ф хсдсм:\nхю, в л ргыг пгобхнг. Фпсхул\nрг чсхс ъгьи л цоюдгмфв :)”" }],
    ["8", { x: 470, y: 280, xk: 638, yk: 385, img: 'paper5', title: '', text: "Фоспгррюм плнусфнст.\n\nНсжзг-хс ф ижс тспсьяб\nзиогол еиолнли схнуюхлв,\nрс фимъгф ср кгдюх л,\nескпсйрс, ргефижзг." }],
    ["9", { x: 470, y: 278, xk: 490, yk: 324, img: 'paper5', title: '', text: " Фхгуюм ытулщ\n\nЕрцхул елзрю кгфсшыли\nсфхгхнл нусел. Дцзяхи\nсфхсусйрю, еизя нхс\nкргих, ъяв ахс нусея..." }],
    ["10", { x: 490, y: 285, xk: 490, yk: 324, img: 'paper5', title: '', text: "Нгухсънг фсхуцзрлнг:\n\nЗйср Зсц, жогег\nзитгухгпирхг\nдлсосжлъифнлш\nлффоизсегрлм" }],
    ["answer", { x: 480, y: 270, xk: 490, yk: 324, img: 'paper5', title: '', text: "Тскзугеовип!\n\nЕю цфтиырс фскзгол\nегнщлрц тусхле елуцфг.\n\nНсзсеси фосес: VXUY" }],

    // ["", { x: 410, y: 370, xk: 400, yk: 500, img: 'paper', key: '', text: '' }],
]);