export const CST = {
    SCENE: {
        LOADINGSCENE: "LoadingScene",
        LOBBYSCENE: "LobbyScene",
        GAMESCENE: "GameScene",
        GAMESCENE2: "GameScene2",
        GAMESCENE3: "GameScene3",
        GAMESCENE4: "GameScene4",
        GAMESCENE5: "GameScene5",
        GAMESCENE6: "GameScene6"
    }
}

export const socket = io();

export const LABEL_ID = {
    DOOR_FORWARD_ID: 11111111,
    DOOR_BACK_ID: 111143444,

    FIRST_KEY: 33333333,
    SECOND_KEY: 44444444,
    THIRD_KEY: 55555555,
    FOURTH_KEY: 6666666,
    FIVETH_KEY: 7777777,
    SIXETH_KEY: 8888888,
    SEVENTH_KEY: 9999999,
    EIGHTH_KEY: 33332245,
    NINETH_KEY: 82342424,

    EMPTY_KEY: 2312525,

    BOARD_KEY: 624234252,
}

export const myMap = new Map([
    ["1", { x: 440, y: 330, xt: 430, yt: 290, img: 'paper1', title: 'Тиуегв нсодг:', text: "• \"Флрлм зсойир лзхл тсфои\nнугфрсжс\"\n• \"Йиохюм щеих кгрлпгих\nхуихяб тсклщлб.\"\n• \"Киоирюм щеих ри псйих\nдюхя тиуеюп\"" }],
    ["2", { x: 490, y: 230, xk: 490, yk: 448, img: 'paper2', title: 'хуихяип ', text: "Пю цфоюыгол нулнл,\nснгкгосфя, ъхс\nтсзстюхрюм тулыио е\nфидв л цнцфло нсооижц. В\nрлнсжзг ри лфтюхюего\nхгнсжс цйгфг. Пю\nкгдгуулнгзлусеголфя е\n                схзиоирлл\nзснцпирхгщлл, рс\nзцпгб, ъхс зсожс пю хцх\nри тусзиуйлпфв." }],
    ["3", { x: 490, y: 230, xk: 568, yk: 324, img: 'paper3', title: 'сзлр ', text: "Пю зсойрю еювфрлхя, нгн\nсфхгрселхя\nугфтусфхугрирли елуцфг!\nЕъиуг          нсооижг\nфнгкго, ъхс ефи тстюхнл\nцйи дифтсоикрю. Рс в ри\nхиувб ргзийзю." }],
    ["4", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper4', title: '', text: "Кгтгфю изю лфхсьгбхфв.\nФоюырс, нгн кг фхиргпл\nнстсыгхфв кспдл. Нгйзюм\nзиря фхгрселхфв ефи\nхуцзрии. В ргълргб\nхиувхя ргзийзц." }],
    ["5", { x: 460, y: 270, xk: 550, yk: 292, img: 'paper5', title: '', text: "Фхгугв кгтлфнг:\n\n”Сфхгелог рг фхсои хесм\nобдлпюм нсчи. Псйих\nфшсзлп епифхи рг сдиз\nкгехуг? ;)”" }],
    ["6", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper1', title: '', text: "Лк тсфоизрлш фло пю\nтусзсойгип\nлффоизсегрлв. Пю ргыол\nтсхирщлго е сдугкщгш,\nнсхсуюи псжол дю\nкгдоснлусегхя елуцф!\nРгзс тусеифхл\nанфтиулпирхю нгн псйрс\nфнсуии." }],
    ["7", { x: 490, y: 230, xk: 660, yk: 232, img: 'paper2', title: 'ъихеиус ', text: "Ргф сфхгосфя                .\nВ ъцефхецб, нгн фхугш л\nтгугрсмв сшегхюегбх\nргф. Кспдл ефи долйи." }],
    ["8", { x: 490, y: 230, xk: 638, yk: 385, img: 'paper3', title: '', text: "Ифол нхс-рлдцзя\nессдьи ргмзих нсжзг-\nрлдцзя ахл кгтлфл:\nри фзгегмхифя.\nЛрчсупгщлв псйих\nфтгфхл плу!\nЕю зсойрю сфхгрселхя\nахс!" }],
    ["9", { x: 490, y: 230, xk: 490, yk: 324, img: 'paper4', title: 'твхя ', text: "Тснг тлыц, фоюыц лш\nтулдолйирли. Ри шсъц,\nъхсдю псл тсфоизрли\n         плрцх йлкрл\nтусыол е гжсрлл, оцъыи\nцмхл дюфхус фгпспц. Н\nфъгфхяб, кзифя прсжси\nпсйих тспсъя при е\nахсп. Кргмхи, в дсусофв\nзс нсрщг." }],

    // ["", { x: 410, y: 370, xk: 400, yk: 500, img: 'paper', key: '', text: '' }],
]);